Hi @surajmahajan2010,

I did a test with the following config with no error.

main.tf
```terraform
locals {
	pools_files = fileset("./", "pools/*.yml")
	pools = { for pool_file in local.pools_files : pool_file => yamldecode(file(pool_file)) 
}
}

resource "bigip_ltm_pool" "pool" {
	for_each = local.pools
		name = each.value.name
		load_balancing_mode = each.value.load_balancing_mode
		minimum_active_members = each.value.minimum_active_members
		monitors = [each.value.monitors]
}

resource "time_sleep" "wait_30_seconds" {
	create_duration = "30s"

	depends_on = [
		bigip_ltm_pool.pool
	]
}

resource "bigip_ltm_pool_attachment" "attach_node" {
	for_each = local.pools
		pool = each.value.name
		node = each.value.node
	depends_on = [
		time_sleep.wait_30_seconds
	]
}
```

pool1.yml
```console
name: "/Common/terraform-pool1"
load_balancing_mode: "round-robin"
description: "Test-Pool"
monitors: "/Common/tcp"
minimum_active_members: 1
allow_snat: "yes"
allow_nat: "yes"
node: "192.168.30.1:80"
```

pool2.yml
```console
name: "/Common/terraform-pool2"
load_balancing_mode: "round-robin"
description: "Test-Pool2"
monitors: "/Common/http"
minimum_active_members: 2
allow_snat: "yes"
allow_nat: "yes"
node: "192.168.50.1:80"
```

```console
$ terraform plan -out test-tmp

Terraform used the selected providers to generate the following execution plan. Resource
actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_pool.pool["pools/pool1.yml"] will be created
  + resource "bigip_ltm_pool" "pool" {
      + allow_nat              = (known after apply)
      + allow_snat             = (known after apply)
      + id                     = (known after apply)
      + load_balancing_mode    = "round-robin"
      + minimum_active_members = 1
      + monitors               = [
          + "/Common/tcp",
        ]
      + name                   = "/Common/terraform-pool1"
      + reselect_tries         = (known after apply)
      + service_down_action    = (known after apply)
      + slow_ramp_time         = (known after apply)
    }

  # bigip_ltm_pool.pool["pools/pool2.yml"] will be created
  + resource "bigip_ltm_pool" "pool" {
      + allow_nat              = (known after apply)
      + allow_snat             = (known after apply)
      + id                     = (known after apply)
      + load_balancing_mode    = "round-robin"
      + minimum_active_members = 2
      + monitors               = [
          + "/Common/http",
        ]
      + name                   = "/Common/terraform-pool2"
      + reselect_tries         = (known after apply)
      + service_down_action    = (known after apply)
      + slow_ramp_time         = (known after apply)
    }

  # bigip_ltm_pool_attachment.attach_node["pools/pool1.yml"] will be created
  + resource "bigip_ltm_pool_attachment" "attach_node" {
      + connection_limit      = (known after apply)
      + connection_rate_limit = (known after apply)
      + dynamic_ratio         = (known after apply)
      + id                    = (known after apply)
      + node                  = "192.168.30.1:80"
      + pool                  = "/Common/terraform-pool1"
      + priority_group        = (known after apply)
      + ratio                 = (known after apply)
    }

  # bigip_ltm_pool_attachment.attach_node["pools/pool2.yml"] will be created
  + resource "bigip_ltm_pool_attachment" "attach_node" {
      + connection_limit      = (known after apply)
      + connection_rate_limit = (known after apply)
      + dynamic_ratio         = (known after apply)
      + id                    = (known after apply)
      + node                  = "192.168.50.1:80"
      + pool                  = "/Common/terraform-pool2"
      + priority_group        = (known after apply)
      + ratio                 = (known after apply)
    }

  # time_sleep.wait_30_seconds will be created
  + resource "time_sleep" "wait_30_seconds" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

───────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: test-tmp

To perform exactly these actions, run the following command to apply:
    terraform apply "test-tmp"

$ terraform apply "test-tmp"
bigip_ltm_pool.pool["pools/pool2.yml"]: Creating...
bigip_ltm_pool.pool["pools/pool1.yml"]: Creating...
bigip_ltm_pool.pool["pools/pool2.yml"]: Creation complete after 0s [id=/Common/terraform-pool2]
bigip_ltm_pool.pool["pools/pool1.yml"]: Creation complete after 0s [id=/Common/terraform-pool1]
time_sleep.wait_30_seconds: Creating...
time_sleep.wait_30_seconds: Still creating... [10s elapsed]
time_sleep.wait_30_seconds: Still creating... [20s elapsed]
time_sleep.wait_30_seconds: Still creating... [30s elapsed]
time_sleep.wait_30_seconds: Creation complete after 30s [id=2022-09-22T15:10:13Z]
bigip_ltm_pool_attachment.attach_node["pools/pool1.yml"]: Creating...
bigip_ltm_pool_attachment.attach_node["pools/pool2.yml"]: Creating...
bigip_ltm_pool_attachment.attach_node["pools/pool2.yml"]: Creation complete after 1s [id=/Common/terraform-pool2]
bigip_ltm_pool_attachment.attach_node["pools/pool1.yml"]: Creation complete after 1s [id=/Common/terraform-pool1]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.
```

But I got the same error when trying to create again a node using the bigip_ltm_node resources.
So I think you are trying to create a node (or recreate) but he already exists.